In [2]:
import pandas as pd

#Read CSV File of Major League Baseball Salaries(mlbsalaries.csv)

In [3]:
df = pd.read_csv('dataset/mlbsalaries.csv')

In [3]:
df.shape

(19543, 5)

In [4]:
df.head()

   Year           Player   Salary           Position                Team
0  1988        Mike Witt  1400000            Pitcher  Los Angeles Angels
1  1988  George Hendrick   989333         Outfielder  Los Angeles Angels
2  1988      Chili Davis   950000         Outfielder  Los Angeles Angels
3  1988    Brian Downing   900000  Designated Hitter  Los Angeles Angels
4  1988        Bob Boone   883000            Catcher  Los Angeles Angels

#### value_counts() is used to identify unique values and their counts

In [5]:
df.Year.value_counts()

#similarly we can get info about unique teams and their counts
#df.Team.value_counts()

#similarly with Position
#df.Position.value_counts()

1990    972
1999    919
2008    858
2001    857
2002    849
2007    848
1998    846
2011    843
2000    843
2004    833
2005    831
2010    828
2003    826
2006    823
2009    818
1995    805
1993    786
1997    773
1996    768
1992    753
1994    748
1991    720
1989    710
1988    686
Name: Year, dtype: int64

#### retrieve information for year 2010

In [6]:
yr_2010 = df[df.Year == 2010]

In [7]:
yr_2010.shape

(828, 5)

In [8]:
yr_2010.head()

       Year         Player    Salary    Position                Team
17872  2010   Torii Hunter  18500000  Outfielder  Los Angeles Angels
17873  2010    Bobby Abreu   9000000  Outfielder  Los Angeles Angels
17874  2010  Brian Fuentes   9000000     Pitcher  Los Angeles Angels
17875  2010   Scott Kazmir   8000000     Pitcher  Los Angeles Angels
17876  2010   Joel Pineiro   8000000     Pitcher  Los Angeles Angels

#### sort rows on the basis of player name in alphabatic order

In [9]:
yr_2010.sort_values('Player').head()

       Year           Player    Salary Position                  Team
18679  2010     A.J. Burnett  16500000  Pitcher      New York Yankees
18655  2010  A.J. Pierzynski   6750000  Catcher     Chicago White Sox
18540  2010       Aaron Cook   9625000  Pitcher      Colorado Rockies
18484  2010     Aaron Harang  12500000  Pitcher       Cincinnati Reds
18108  2010    Aaron Heilman   2150000  Pitcher  Arizona Diamondbacks

#### sort column labels

In [35]:
yr_2010.sort_index(axis=1,inplace=True)
yr_2010.head()

              Player    Position    Salary                Team  Year
17872   Torii Hunter  Outfielder  18500000  Los Angeles Angels  2010
17873    Bobby Abreu  Outfielder   9000000  Los Angeles Angels  2010
17874  Brian Fuentes     Pitcher   9000000  Los Angeles Angels  2010
17875   Scott Kazmir     Pitcher   8000000  Los Angeles Angels  2010
17876   Joel Pineiro     Pitcher   8000000  Los Angeles Angels  2010

#### find top 5 highest paid salary

In [11]:
yr_2010.Salary.sort_values(ascending=False).head()

18675    33000000
18676    24285714
18677    22600000
18678    20625000
18263    20144707
Name: Salary, dtype: int64

#### find top 5 highest paid salaries  and corresponding player name

In [12]:
yr_2010.loc[yr_2010.Salary.sort_values(ascending=False).index[:5],['Player','Salary']]

               Player    Salary
18675  Alex Rodriguez  33000000
18676     CC Sabathia  24285714
18677     Derek Jeter  22600000
18678   Mark Teixeira  20625000
18263   Johan Santana  20144707

#### find 10 highest paid salaries record

In [13]:
yr_2010.sort_values(ascending=False,by='Salary').head(10)

       Year           Player    Salary       Position                   Team
18675  2010   Alex Rodriguez  33000000  Third Baseman       New York Yankees
18676  2010      CC Sabathia  24285714        Pitcher       New York Yankees
18677  2010      Derek Jeter  22600000      Shortstop       New York Yankees
18678  2010    Mark Teixeira  20625000  First Baseman       New York Yankees
18263  2010    Johan Santana  20144707        Pitcher          New York Mets
18594  2010   Miguel Cabrera  20000000  First Baseman         Detroit Tigers
18264  2010   Carlos Beltran  19401569     Outfielder          New York Mets
17901  2010       Carlos Lee  19000000     Outfielder         Houston Astros
18071  2010  Alfonso Soriano  19000000     Outfielder           Chicago Cubs
18373  2010      Ryan Howard  19000000  First Baseman  Philadelphia Phillies

#### Groupby using Year

In [14]:
group_yr = df.groupby('Year')

In [53]:
group_yr.Salary.max()

Year
1988     2360714
1989     2766666
1990     3200000
1991     3800000
1992     6100000
1993     6200000
1994     6300000
1995     9237500
1996     9237500
1997    10000000
1998    10000000
1999    11949794
2000    15714286
2001    22000000
2002    22000000
2003    22000000
2004    22500000
2005    26000000
2006    21680727
2007    23428571
2008    28000000
2009    33000000
2010    33000000
2011    32000000
Name: Salary, dtype: int64

In [58]:
r=[]
for i,k in group_yr:
    #print 'year:',i
    #print i,k
    r.append(k.sort_values('Salary',ascending=False).head(1))

#### Extract highest paid from each group(Year)

In [15]:
for k,group in group_yr:
    print group.sort_values(ascending=False,by='Salary')[:1]

     Year       Player   Salary Position           Team
321  1988  Gary Carter  2360714  Catcher  New York Mets
     Year          Player   Salary Position                 Team
908  1989  Orel Hershiser  2766666  Pitcher  Los Angeles Dodgers
      Year       Player   Salary    Position               Team
1580  1990  Robin Yount  3200000  Outfielder  Milwaukee Brewers
      Year             Player   Salary    Position                 Team
2590  1991  Darryl Strawberry  3800000  Outfielder  Los Angeles Dodgers
      Year         Player   Salary    Position           Team
3441  1992  Bobby Bonilla  6100000  Outfielder  New York Mets
      Year         Player   Salary    Position           Team
4214  1993  Bobby Bonilla  6200000  Outfielder  New York Mets
      Year         Player   Salary       Position           Team
4977  1994  Bobby Bonilla  6300000  Third Baseman  New York Mets
      Year         Player   Salary       Position            Team
6068  1995  Cecil Fielder  9237500  First Baseman  Detroit Tigers
      Year         Player   Salary       Position            Team
6840  1996  Cecil Fielder  9237500  First Baseman  Detroit Tigers
      Year        Player    Salary    Position               Team
7666  1997  Albert Belle  10000000  Outfielder  Chicago White Sox
      Year          Player    Salary    Position             Team
8090  1998  Gary Sheffield  10000000  Outfielder  Florida Marlins
      Year        Player    Salary    Position               Team
9067  1999  Albert Belle  11949794  Outfielder  Baltimore Orioles
      Year          Player    Salary Position                 Team
9743  2000  Kevin J. Brown  15714286  Pitcher  Los Angeles Dodgers
       Year          Player    Salary   Position           Team
10903  2001  Alex Rodriguez  22000000  Shortstop  Texas Rangers
       Year          Player    Salary   Position           Team
11752  2002  Alex Rodriguez  22000000  Shortstop  Texas Rangers
       Year          Player    Salary   Position           Team
12589  2003  Alex Rodriguez  22000000  Shortstop  Texas Rangers
       Year         Player    Salary    Position            Team
13497  2004  Manny Ramirez  22500000  Outfielder  Boston Red Sox
       Year          Player    Salary       Position              Team
14499  2005  Alex Rodriguez  26000000  Third Baseman  New York Yankees
       Year          Player    Salary       Position              Team
15320  2006  Alex Rodriguez  21680727  Third Baseman  New York Yankees
       Year        Player    Salary           Position              Team
16167  2007  Jason Giambi  23428571  Designated Hitter  New York Yankees
       Year          Player    Salary       Position              Team
17023  2008  Alex Rodriguez  28000000  Third Baseman  New York Yankees
       Year          Player    Salary       Position              Team
17846  2009  Alex Rodriguez  33000000  Third Baseman  New York Yankees
       Year          Player    Salary       Position              Team
18675  2010  Alex Rodriguez  33000000  Third Baseman  New York Yankees
       Year          Player    Salary       Position              Team
19513  2011  Alex Rodriguez  32000000  Third Baseman  New York Yankees

In [16]:
t=(group.sort_values(ascending=False,by='Salary')[:1] for k,group in group_yr)

In [59]:
top = pd.DataFrame()

In [60]:
for k in r:
    
    top=top.append(k)

In [61]:
top

,Year,Player,Salary,Position,Team
321,1988,Gary Carter,2360714,Catcher,New York Mets
908,1989,Orel Hershiser,2766666,Pitcher,Los Angeles Dodgers
1580,1990,Robin Yount,3200000,Outfielder,Milwaukee Brewers
2590,1991,Darryl Strawberry,3800000,Outfielder,Los Angeles Dodgers
3441,1992,Bobby Bonilla,6100000,Outfielder,New York Mets
4214,1993,Bobby Bonilla,6200000,Outfielder,New York Mets
4977,1994,Bobby Bonilla,6300000,Third Baseman,New York Mets
6068,1995,Cecil Fielder,9237500,First Baseman,Detroit Tigers
6840,1996,Cecil Fielder,9237500,First Baseman,Detroit Tigers
7666,1997,Albert Belle,10000000,Outfielder,Chicago White Sox
8090,1998,Gary Sheffield,10000000,Outfielder,Florida Marlins
9067,1999,Albert Belle,11949794,Outfielder,Baltimore Orioles
9743,2000,Kevin J. Brown,15714286,Pitcher,Los Angeles Dodgers
10903,2001,Alex Rodriguez,22000000,Shortstop,Texas Rangers
11752,2002,Alex Rodriguez,22000000,Shortstop,Texas Rangers
12589,2003,Alex Rodriguez,22000000,Shortstop,Texas Rangers
13497,2004,Manny Ramirez,22500000,Outfielder,Boston Red Sox
14499,2005,Alex Rodriguez,26000000,Third Baseman,New York Yankees
15320,2006,Alex Rodriguez,21680727,Third Baseman,New York Yankees
16167,2007,Jason Giambi,23428571,Designated Hitter,New York Yankees
17023,2008,Alex Rodriguez,28000000,Third Baseman,New York Yankees
17846,2009,Alex Rodriguez,33000000,Third Baseman,New York Yankees
18675,2010,Alex Rodriguez,33000000,Third Baseman,New York Yankees
19513,2011,Alex Rodriguez,32000000,Third Baseman,New York Yankees

#### Appending Dataframe

In [20]:
df = pd.DataFrame([[1, 2], [3, 4]],columns=['A','B'])

In [21]:
df1 = pd.DataFrame([[5, 6], [7,8]])

In [22]:
df2 = pd.DataFrame([[9, 10], [11,12]])

In [23]:
df=df1.append(df2,ignore_index=True)

#d=df.append(df1,ignore_index=True)
#df3=df.append(df2)
#df3
#df
df

    0   1
0   5   6
1   7   8
2   9  10
3  11  12

In [24]:
df

    0   1
0   5   6
1   7   8
2   9  10
3  11  12

In [25]:
df.append(df2)

    0   1
0   5   6
1   7   8
2   9  10
3  11  12
0   9  10
1  11  12

#### Create a series of top salaries and plot

In [26]:
tp = top[['Year','Salary']]

In [27]:
tp=tp.set_index('Year')

In [28]:
tp

        Salary
Year
1988   2360714
1989   2766666
1990   3200000
1991   3800000
1992   6100000
1993   6200000
1994   6300000
1995   9237500
1996   9237500
1997  10000000
1998  10000000
1999  11949794
2000  15714286
2001  22000000
2002  22000000
2003  22000000
2004  22500000
2005  26000000
2006  21680727
2007  23428571
2008  28000000
2009  33000000
2010  33000000
2011  32000000

In [29]:
%matplotlib inline

In [4]:
tp.plot(kind='bar')
tp.plot()

NameError: name 'tp' is not defined

In [31]:
def count(X):
    return X.upper()

In [32]:
yr_2010.

SyntaxError: invalid syntax (<ipython-input-32-2da1b02d9c32>, line 1)

In [71]:
pd.DataFrame(r[0])

     Year       Player   Salary Position           Team
321  1988  Gary Carter  2360714  Catcher  New York Mets

In [70]:
t

,0,1,2,3,4,5,6,7,8,9,...,14,15,16,17,18,19,20,21,22,23
0,Year Player Salary Position ...,Year Player Salary Position ...,Year Player Salary Position ...,Year Player Salary Posi...,Year Player Salary Position...,Year Player Salary Position...,Year Player Salary Posit...,Year Player Salary Posit...,Year Player Salary Posit...,Year Player Salary Position...,...,Year Player Salary Positi...,Year Player Salary Positi...,Year Player Salary Positi...,Year Player Salary Po...,Year Player Salary Po...,Year Player Salary ...,Year Player Salary Po...,Year Player Salary Po...,Year Player Salary Po...,Year Player Salary Po...